Саракташ2/src/InformationRegisters/ПравилаУпаковкиЗаказов/ПравилаУпаковкиЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПравилаУпаковкиЗаказов</name>
  <resources>
    <name>КоличествоТовара</name>
    <type>
      <types>DefinedType.ТипКоличество</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоУпаковка</name>
    <type>
      <types>DefinedType.ТипКоличество</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ТипПравила</name>
    <type>
      <types>EnumRef.ТипыПравилУпаковки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.КатегорииТоваров</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЗаказа</name>
    <type>
      <types>EnumRef.ВидыЗаказовПокупателей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Саракташ2/src/Enums/ТипыПравилУпаковки/ТипыПравилУпаковки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПравилУпаковки</name>
  <enumValues>
    <name>ДляКаждойПозиции</name>
  </enumValues>
  <enumValues>
    <name>ДляКатегорииПозиции</name>
  </enumValues>
  <enumValues>
    <name>ДляКаждогоЗаказа</name>
  </enumValues>
</mdclass:Enum>

Саракташ2/src/InformationRegisters/ПравилаУпаковкиЗаказов/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустой() Тогда    		
		Запись.ТипПравила = Перечисления.ТипыПравилУпаковки.ДляКаждогоЗаказа;  
	Иначе
		Если Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКаждогоЗаказа") Тогда
			//	
		ИначеЕсли Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКатегорииПозиции") Тогда
			Категория = Запись.Номенклатура;
			КоличествоТовара = запись.КоличествоТовара;
		ИначеЕсли Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКаждойПозиции") Тогда
			Номенклатура = Запись.Номенклатура;
			КоличествоТовара = запись.КоличествоТовара;
		КонецЕсли;
		Упаковка = Запись.Упаковка;
		КоличествоУпаковка = Запись.КоличествоУпаковка;       
	КонецЕсли;		
		
КонецПроцедуры   

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьВидФормы();

КонецПроцедуры

&НаКлиенте
Процедура НастроитьВидФормы()
	
	Если Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКаждогоЗаказа") Тогда
		Запись.Номенклатура = Неопределено;
		Запись.КоличествоУпаковка = 0;
		Элементы.Номенклатура.Видимость = Ложь;
		Элементы.Категория.Видимость = Ложь;
		Элементы.КоличествоТовара.Видимость = Ложь;
	ИначеЕсли Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКатегорииПозиции") Тогда
		Элементы.Номенклатура.Видимость = Ложь;
		Элементы.Категория.Видимость = Истина;
		Элементы.КоличествоТовара.Видимость = Истина; 
	ИначеЕсли Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКаждойПозиции") Тогда
		Элементы.Номенклатура.Видимость = Истина;
		Элементы.Категория.Видимость = Ложь;
		Элементы.КоличествоТовара.Видимость = Истина;    
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипПравилаПриИзменении(Элемент)
	
	 НастроитьВидФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗаполненоКорректно() Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКаждогоЗаказа") Тогда
		Запись.Номенклатура = Неопределено;
	ИначеЕсли Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКатегорииПозиции") Тогда
		Запись.Номенклатура = Категория;  
		Запись.КоличествоТовара = КоличествоТовара;
	ИначеЕсли Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКаждойПозиции") Тогда
		Запись.Номенклатура = Номенклатура;
		Запись.КоличествоТовара = КоличествоТовара;   
	КонецЕсли;
	Запись.Упаковка = Упаковка;
	Запись.КоличествоУпаковка = КоличествоУпаковка;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполненоКорректно()
	
	Если Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКатегорииПозиции") Тогда
		Если НЕ ЗначениеЗаполнено(Категория) Тогда
			ПоказатьПредупреждение(,"Не заполнена категория товара!",15);
			Возврат Ложь;
		КонецЕсли;
		Если КоличествоТовара <= 0 Тогда
			ПоказатьПредупреждение(,"Не заполнено количество товара в заказе!",15);
			Возврат Ложь;
		КонецЕсли;  	
	ИначеЕсли Запись.ТипПравила = ПредопределенноеЗначение("Перечисление.ТипыПравилУпаковки.ДляКаждойПозиции") Тогда
		Если КоличествоТовара <= 0 Тогда
			ПоказатьПредупреждение(,"Не заполнено количество товара в заказе!",15);
			Возврат Ложь;
		КонецЕсли; 		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
